; domain
(define (domain cooking)

    (:types ;
        movable location - object ; a manipulatable(movable) object
        workspace - location ; can be used for cutting
        container - movable ; something can be in a container
        veggie tool - movable ; objects that can be manipulated (pick/place/...)
        cuttool - tool ; tools that can cut
        gripper ; robotic gripper can hold objects
    )

    (:predicates ;
        ; General object predicates
        (is-sliced ?veg - veggie) ; True if veggie is sliced - observed predicate
        (available ?obj - movable) ; True is object is pickable - derived predicate
        (is-whole ?veg - veggie) ; True if veggie is intact - derived predicate

        ; Robot predicates
        (carry ?gripper - gripper ?obj - movable) ; - observed predicate
        (free ?gripper - gripper) ;  - derived predicate

        ; Location predicates
        (at ?obj - movable ?loc - location) ; True if ?obj is at ?loc - observed predicate
        (in ?obj - movable ?con - container) ; True if ?obj is in ?con - observed predicate
    )

    (:action pick
        :parameters (?bot - gripper ?obj - movable ?pick_loc - location)
        :precondition(
            and
            (available ?obj)
            (free ?bot)
            (at ?obj ?pick_loc)
        )
        :effect(
            and
            (not (available ?obj))
            (carry ?bot ?obj)
            (not (free ?bot))
            (not (at ?obj ?pick_loc))
        )
    )

    (:action place
        :parameters (?bot - gripper ?obj - movable ?place_loc - location)
        :precondition(
            and
            (carry ?bot ?obj)
            (not (free ?bot))
            (not (at ?obj ?place_loc))
        )
        :effect(
            and
            (available ?obj)
            (free ?bot)
            (at ?obj ?place_loc)
            (not (carry ?bot ?obj))
        )
    )

     (:action place_in
        :parameters (?bot - gripper ?obj - movable ?place_loc - container)
        :precondition(
            and
            (carry ?bot ?obj)
            (not (free ?bot))
            (not (in ?obj ?place_loc))
        )
        :effect(
            and
            (available ?obj)
            (free ?bot)
            (in ?obj ?place_loc)
            (not (carry ?bot ?obj))
        )
    )

    (:action slice
        :parameters (?bot - gripper ?veg - veggie ?cuttool - cuttool ?loc - workspace)
        :precondition(
            and
            (carry ?bot ?cuttool)
            (is-whole ?veg)
            (not (is-sliced ?veg))
            (at ?veg ?loc)
        )
        :effect(
            and
            (is-sliced ?veg)
            (not (is-whole ?veg))
        )
    )
  )

; problem
(define (problem cooking6)
(:domain cooking)
(:objects
    black_tray - location
    wooden_board - workspace
    bowl - container
    robotic_gripper - gripper
    robotic_gripper1 - gripper
    chopping_knife - cuttool
    cucumber - veggie
    carrot - veggie
)
(:init
    ( at bowl black_tray )
    ( at carrot black_tray )
    ( at cucumber black_tray )
    ( available bowl )
    ( available carrot )
    ( available cucumber )
    ( carry robotic_gripper chopping_knife )
    ( free robotic_gripper1 )
    ( is-whole carrot )
    ( is-whole cucumber )
)

    (:goal
        (and
            (in cucumber bowl)
            (in carrot bowl)
            (is-sliced cucumber)
            (is-sliced carrot)
        )
    )
)

; plan
1. (pick robotic_gripper1 carrot black_tray)
   deleted: (available carrot) (free robotic_gripper1) (at carrot black_tray)
   added: (carry robotic_gripper1 carrot)
   goals met: 0 of 4
2. (place robotic_gripper1 carrot wooden_board)
   deleted: (carry robotic_gripper1 carrot)
   added: (available carrot) (free robotic_gripper1) (at carrot wooden_board)
   goals met: 0 of 4
3. (slice robotic_gripper carrot chopping_knife wooden_board)
   deleted: (is-whole carrot)
   added: (is-sliced carrot)
   goals met: 1 of 4
4. (pick robotic_gripper1 carrot wooden_board)
   deleted: (available carrot) (free robotic_gripper1) (at carrot wooden_board)
   added: (carry robotic_gripper1 carrot)
   goals met: 1 of 4
5. (place_in robotic_gripper1 carrot bowl)
   deleted: (carry robotic_gripper1 carrot)
   added: (available carrot) (free robotic_gripper1) (in carrot bowl)
   goals met: 2 of 4
6. (pick robotic_gripper1 cucumber black_tray)
   deleted: (available cucumber) (free robotic_gripper1) (at cucumber black_tray)
   added: (carry robotic_gripper1 cucumber)
   goals met: 2 of 4
7. (place robotic_gripper1 cucumber wooden_board)
   deleted: (carry robotic_gripper1 cucumber)
   added: (available cucumber) (free robotic_gripper1) (at cucumber wooden_board)
   goals met: 2 of 4
8. (slice robotic_gripper cucumber chopping_knife wooden_board)
   deleted: (is-whole cucumber)
   added: (is-sliced cucumber)
   goals met: 3 of 4
9. (pick robotic_gripper1 cucumber wooden_board)
   deleted: (available cucumber) (free robotic_gripper1) (at cucumber wooden_board)
   added: (carry robotic_gripper1 cucumber)
   goals met: 3 of 4
10. (place_in robotic_gripper1 cucumber bowl)
   deleted: (carry robotic_gripper1 cucumber)
   added: (available cucumber) (free robotic_gripper1) (in cucumber bowl)
   goals met: 4 of 4
